FV2510/E_0038.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.1 | 11.12.2025 (urspr. 01.04.2025)
endfooter

title
MaBiS

7.33.1: AD: Übermittlung der Bilanzkreissummenzeitreihe vom NB an BIKO und BKV



end title
:<b>E_0038</b>;
note right
<b><i>Prüfende Rolle: BIKO
end note

if (<b>1: </b> Erfolgt der Eingang der Zeitreihe nach Ablauf der Clearingfrist für die KBKA?) then (ja)
    :A01;
    note left
        Fristüberschreitung
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Ist der MaBiS-ZP zum betrachteten Bilanzierungsmonat aktiv?) then (ja)
else (nein)
    :A02;
    note left
        Gewählter Zeitraum nicht zulässig
    endnote
    kill;
endif
if (<b>3: </b> Wird die Frist von 2 WT vor dem erforderlichen Versand der Zeitreihe nach der Aktivierung eingehalten?) then (ja)
else (nein)
    :A03;
    note left
        Fristunterschreitung
    endnote
    kill;
endif
if (<b>4: </b> Liegt die Version der Zeitreihe des MaBiS-ZP für diesen Bilanzierungsmonat bereits vor?) then (ja)
    :A04;
    note left
        Zeitreihe bereits vorhanden
    endnote
    kill;
else (nein)
endif
if (<b>5: </b> Ist die Version der Zeitreihe des MaBiS-ZP höher als die bisher höchste verarbeitete Version der Zeitreihe für diesen Bilanzierungsmonat und diesen MaBiS-ZP?) then (ja)
    end
else (nein)
    :A05;
    note left
        Version nicht zugelassen
    endnote
    kill;
endif

@enduml
